title: Detection for CVE-2024-3400
id: 7360a2ec-0bf5-4a2a-9093-3e3229b3e6d3
status: experimental
description: 'A command injection as a result of arbitrary file creation vulnerability
  in the GlobalProtect feature of Palo Alto Networks PAN-OS software for specific
  PAN-OS versions and distinct feature configurations may enable an unauthenticated
  attacker to execute arbitrary code with root privileges on the firewall.


  Cloud NGFW, Panorama appliances, and Prisma Access are not impacted by this vulnerability.'
references:
- https://security.paloaltonetworks.com/CVE-2024-3400
- https://unit42.paloaltonetworks.com/cve-2024-3400/
- https://www.paloaltonetworks.com/blog/2024/04/more-on-the-pan-os-cve/
author: Kwaw Fletcher Frimpong
date: 2025/06/29
tags:
- cve.cve.2024.3400
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1
    Image|endswith: \malicious.exe
  condition: selection
fields:
- Image
- CommandLine
- ParentImage
falsepositives:
- Legitimate testing tools
level: medium
