title: Detection for CVE-2025-6835
id: 443eaf0d-32a9-4755-b9de-5684452ab69d
status: experimental
description: A vulnerability was found in code-projects Library System 1.0. It has
  been rated as critical. This issue affects some unknown processing of the file /student-issue-book.php.
  The manipulation of the argument reg leads to sql injection. The attack may be initiated
  remotely. The exploit has been disclosed to the public and may be used.
references:
- https://code-projects.org/
- https://github.com/blueandhack/cve/issues/6
- https://vuldb.com/?ctiid.314279
author: Kwaw Fletcher Frimpong
date: 2025/06/29
tags:
- cve.cve.2025.6835
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    EventID: 1
    Image|endswith: \malicious.exe
  condition: selection
fields:
- Image
- CommandLine
- ParentImage
falsepositives:
- Legitimate testing tools
level: medium
